docs/stress-test/results/k6-write/stage6-k6-write-flow-5vu.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: tests/k6/rme-write-full-flow-local.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 10m30s max duration (incl. graceful stop):
              * write_flow: 5 iterations for each of 5 VUs (maxDuration: 10m0s, exec: writeFlow, gracefulStop: 30s)


running (00m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m01.0s/10m0s  00/25 iters, 5 per VU

running (00m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m02.0s/10m0s  00/25 iters, 5 per VU

running (00m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m03.0s/10m0s  00/25 iters, 5 per VU

running (00m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m04.0s/10m0s  00/25 iters, 5 per VU

running (00m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m05.0s/10m0s  00/25 iters, 5 per VU

running (00m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
write_flow   [   0% ] 5 VUs  00m06.0s/10m0s  00/25 iters, 5 per VU

running (00m07.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
write_flow   [   8% ] 5 VUs  00m07.0s/10m0s  02/25 iters, 5 per VU

running (00m08.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
write_flow   [  12% ] 5 VUs  00m08.0s/10m0s  03/25 iters, 5 per VU

running (00m09.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
write_flow   [  16% ] 5 VUs  00m09.0s/10m0s  04/25 iters, 5 per VU

running (00m10.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
write_flow   [  20% ] 5 VUs  00m10.0s/10m0s  05/25 iters, 5 per VU

running (00m11.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
write_flow   [  20% ] 5 VUs  00m11.0s/10m0s  05/25 iters, 5 per VU

running (00m12.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
write_flow   [  20% ] 5 VUs  00m12.0s/10m0s  05/25 iters, 5 per VU

running (00m13.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
write_flow   [  20% ] 5 VUs  00m13.0s/10m0s  05/25 iters, 5 per VU

running (00m14.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
write_flow   [  20% ] 5 VUs  00m14.0s/10m0s  05/25 iters, 5 per VU

running (00m15.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
write_flow   [  24% ] 5 VUs  00m15.0s/10m0s  06/25 iters, 5 per VU

running (00m16.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
write_flow   [  28% ] 5 VUs  00m16.0s/10m0s  07/25 iters, 5 per VU

running (00m17.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
write_flow   [  32% ] 5 VUs  00m17.0s/10m0s  08/25 iters, 5 per VU

running (00m18.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
write_flow   [  36% ] 5 VUs  00m18.0s/10m0s  09/25 iters, 5 per VU

running (00m19.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
write_flow   [  40% ] 5 VUs  00m19.0s/10m0s  10/25 iters, 5 per VU

running (00m20.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
write_flow   [  40% ] 5 VUs  00m20.0s/10m0s  10/25 iters, 5 per VU

running (00m21.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
write_flow   [  40% ] 5 VUs  00m21.0s/10m0s  10/25 iters, 5 per VU

running (00m22.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
write_flow   [  40% ] 5 VUs  00m22.0s/10m0s  10/25 iters, 5 per VU

running (00m23.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
write_flow   [  40% ] 5 VUs  00m23.0s/10m0s  10/25 iters, 5 per VU

running (00m24.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
write_flow   [  44% ] 5 VUs  00m24.0s/10m0s  11/25 iters, 5 per VU

running (00m25.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
write_flow   [  48% ] 5 VUs  00m25.0s/10m0s  12/25 iters, 5 per VU

running (00m26.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
write_flow   [  52% ] 5 VUs  00m26.0s/10m0s  13/25 iters, 5 per VU

running (00m27.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
write_flow   [  56% ] 5 VUs  00m27.0s/10m0s  14/25 iters, 5 per VU

running (00m28.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
write_flow   [  60% ] 5 VUs  00m28.0s/10m0s  15/25 iters, 5 per VU

running (00m29.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
write_flow   [  60% ] 5 VUs  00m29.0s/10m0s  15/25 iters, 5 per VU

running (00m30.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
write_flow   [  60% ] 5 VUs  00m30.0s/10m0s  15/25 iters, 5 per VU

running (00m31.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
write_flow   [  60% ] 5 VUs  00m31.0s/10m0s  15/25 iters, 5 per VU

running (00m32.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
write_flow   [  60% ] 5 VUs  00m32.0s/10m0s  15/25 iters, 5 per VU

running (00m33.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
write_flow   [  64% ] 5 VUs  00m33.0s/10m0s  16/25 iters, 5 per VU

running (00m34.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
write_flow   [  68% ] 5 VUs  00m34.0s/10m0s  17/25 iters, 5 per VU

running (00m35.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
write_flow   [  68% ] 5 VUs  00m35.0s/10m0s  17/25 iters, 5 per VU

running (00m36.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
write_flow   [  76% ] 5 VUs  00m36.0s/10m0s  19/25 iters, 5 per VU

running (00m37.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
write_flow   [  80% ] 5 VUs  00m37.0s/10m0s  20/25 iters, 5 per VU

running (00m38.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
write_flow   [  80% ] 5 VUs  00m38.0s/10m0s  20/25 iters, 5 per VU

running (00m39.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
write_flow   [  80% ] 5 VUs  00m39.0s/10m0s  20/25 iters, 5 per VU

running (00m40.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
write_flow   [  80% ] 5 VUs  00m40.0s/10m0s  20/25 iters, 5 per VU

running (00m41.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
write_flow   [  80% ] 5 VUs  00m41.0s/10m0s  20/25 iters, 5 per VU

running (00m42.0s), 4/5 VUs, 21 complete and 0 interrupted iterations
write_flow   [  84% ] 5 VUs  00m42.0s/10m0s  21/25 iters, 5 per VU

running (00m43.0s), 3/5 VUs, 22 complete and 0 interrupted iterations
write_flow   [  88% ] 5 VUs  00m43.0s/10m0s  22/25 iters, 5 per VU

running (00m44.0s), 3/5 VUs, 22 complete and 0 interrupted iterations
write_flow   [  88% ] 5 VUs  00m44.0s/10m0s  22/25 iters, 5 per VU

running (00m45.0s), 2/5 VUs, 23 complete and 0 interrupted iterations
write_flow   [  92% ] 5 VUs  00m45.0s/10m0s  23/25 iters, 5 per VU


  █ THRESHOLDS

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    visit_create_success_rate
    ✓ 'rate>0.99' rate=100.00%

    write_flow_success_rate
    ✓ 'rate>0.99' rate=100.00%


  █ TOTAL RESULTS

    checks_total.......: 225     4.917221/s
    checks_succeeded...: 100.00% 225 out of 225
    checks_failed......: 0.00%   0 out of 225

    ✓ login page 200
    ✓ login accepted
    ✓ authenticated (not /login)
    ✓ context set (redirect, not /login)
    ✓ visit index 200
    ✓ visit create redirected
    ✓ visit id parsed
    ✓ visit show 200
    ✓ patient queue 200

    CUSTOM
    page_verify_success_rate.......: 100.00% 25 out of 25
    visit_create_success_rate......: 100.00% 25 out of 25
    write_flow_duration............: avg=8.48s    min=5.72s   med=8.76s    max=9.06s p(90)=9.03s p(95)=9.05s
    write_flow_success_rate........: 100.00% 25 out of 25

    HTTP
    http_req_duration..............: avg=861.47ms min=20.69ms med=702.88ms max=3.16s p(90)=1.75s p(95)=2.06s
      { expected_response:true }...: avg=861.47ms min=20.69ms med=702.88ms max=3.16s p(90)=1.75s p(95)=2.06s
    http_req_failed................: 0.00%   0 out of 246
    http_reqs......................: 246     5.376162/s

    EXECUTION
    iteration_duration.............: avg=8.78s    min=6.02s   med=9.06s    max=9.37s p(90)=9.33s p(95)=9.35s
    iterations.....................: 25      0.546358/s
    vus............................: 2       min=2        max=5
    vus_max........................: 5       min=5        max=5

    NETWORK
    data_received..................: 7.1 MB  154 kB/s
    data_sent......................: 200 kB  4.4 kB/s



running (00m45.8s), 0/5 VUs, 25 complete and 0 interrupted iterations
write_flow ✓ [ 100% ] 5 VUs  00m45.8s/10m0s  25/25 iters, 5 per VU